       IDENTIFICATION DIVISION.
       PROGRAM-ID. P1.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 STARTING_AMOUNT PIC 9 VALUE 0.
       01 ENDING_AMOUNT PIC 9 VALUE 0.
       01 DIFFERENCE_AMOUNT PIC 9 VALUE 0.
       01 MONTHS_BETWEEN PIC 9(2) VALUE 1. 
       01 PERCENT_CHANGE PIC 9P VALUE 0.
       01 PERCENT_CHANGE_YEAR PIC 9P VALUE 0.
       01 GOAL_AMOUNT PIC 9 VALUE 1000000.
       01 BIRTH_DAY PIC X(10) VALUE ZEROS.
       01 AGE PIC 9(1) VALUE 0.
       01 TODAYS_DATE PIC X(10) VALUE ZEROS.
       01 YEARS_TO_GROW PIC 9 VALUE 0.
       01 GOAL_AGE PIC 9(1) VALUE 0.

       PROCEDURE DIVISION.

       STOP RUN. 
       