       IDENTIFICATION DIVISION.
       PROGRAM-ID. P1.
       AUTHOR. WILLIAM-KEISLOHN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 STARTING_AMOUNT PIC 9 VALUE 0.
       01 ENDING_AMOUNT PIC 9 VALUE 0.
       01 DIFFERENCE_AMOUNT PIC 9 VALUE 0.
       01 MONTHS_BETWEEN PIC 9(2) VALUE 1. 
       01 PERCENT_CHANGE PIC 9P VALUE 0.
       01 PERCENT_CHANGE_YEAR PIC 9P VALUE 0.
       01 GOAL_AMOUNT PIC 9 VALUE 1000000.
       01 BIRTH_DATE.
         05 BIRTH_MONTH PIC 9(2) VALUE ZEROS.
         05 BIRTH_DAY PIC 9(2) VALUE ZEROES.
         05 BIRTH_YEAR PIC 9(4) VALUE ZEROS.
         05 BIRTH_DAY_CORRECT PIC 9 VALUE 0.
           88 DAY-TRUE VALUE 1.
           88 DAY-FALSE VALUE 0.
         05 BIRTH_DAY_COMMON PIC X(50).
         05 BIRTH_MONTH_NAME PIC A(10).
       01 AGE PIC 9(3) VALUE 0.
       01 AGE_VERIFIED PIC 9(1) VALUE 0.
       01 WS-CURRENT-DATE-FIELDS. *> FROM IBM.
         05 WS-CURRENT-DATE.
           10 WS-CURRENT-YEAR PIC 9(4).
           10 WS-CURRENT-MONTH PIC 9(2).
           10 WS-CURRENT-DAY PIC 9(2).
         05 WS-CURRENT-TIME.
           10 WS-CURRENT-HOUR PIC 9(2).
           10 WS-CURRENT-MINUTE PIC 9(2).
           10 WS-CURRENT-SECOND PIC 9(2).
           10 WS-CURRENT-MS PIC 9(2).
         05 WS-DIFF-FROM-GMT PIC S9(4).
       01 YEARS_TO_GROW PIC 9 VALUE 0.
       01 GOAL_AGE PIC 9(1) VALUE 0.
       01 USER_ANSWER PIC A(3) VALUE "N".

       PROCEDURE DIVISION.

           MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATE-FIELDS
           .

       MAIN-PARA. *>"OOP"
           PERFORM AGE-PARA
           .
           PERFORM INVEST-PARA
           .
           STOP RUN
           .

       AGE-PARA.
           PERFORM BIRTH-DATE-PARA UNTIL AGE_VERIFIED = 1
           .


       BIRTH-DATE-PARA.
           DISPLAY "PLEASE ENTER YOUR BIRTHDAY BELOW"
           .
           DISPLAY "PLEASE ENTER YOUR BIRTH YEAR: " WITH NO ADVANCING
           ACCEPT BIRTH_YEAR
           .
           DISPLAY "PLEASE ENTER YOUR BIRTH MONTH: " WITH NO ADVANCING
           ACCEPT BIRTH_MONTH
           .
           DISPLAY "PLEASE ENTER THE DAY OF THE MONTH YOU WERE BORN: "
             WITH NO ADVANCING
           ACCEPT BIRTH_DAY
           .
           PERFORM COMMON-DATE-PARA
           .
           DISPLAY "IS THIS BIRTHDAY CORRECT? [Y/n] " WITH NO ADVANCING
           ACCEPT USER_ANSWER
           .
           CALL "PUser" USING USER_ANSWER,
                              BIRTH_DAY_CORRECT
           .
           MOVE BIRTH_DAY_CORRECT TO AGE_VERIFIED *> Probably extra. 
           .

       COMMON-DATE-PARA.
           CALL "P1TM" USING BIRTH_MONTH,
                             BIRTH_MONTH_NAME
           .
           STRING BIRTH_MONTH_NAME " " BIRTH_DAY ", " BIRTH_YEAR
             DELIMITED BY SIZE INTO BIRTH_DAY_COMMON
           .
           DISPLAY "THE BIRTHDAY YOU HAVE ENTERED IS: " BIRTH_DAY_COMMON
           .

       INVEST-PARA.
           DISPLAY "PLEASE ENTER YOUR INITIAL INVESTMENT AMOUNT: " WITH
             NO ADVANCING
           ACCEPT STARTING_AMOUNT
           .
           
       STOP RUN. 
