       IDENTIFICATION DIVISION.
       PROGRAM-ID. PUser.
       AUTHOR. WILLIAM-KEILSOHN.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 POSITIVE_ANSWERS PIC A(3) VALUE "YES".
       01 USER_RSPONSE_STORE PIC A(3).

       LINKAGE SECTION.
       01 USER_RSPONSE PIC A(3).
       01 USER_VALUE PIC 9 VALUE 0.

       PROCEDURE DIVISION USING USER_RSPONSE,
       USER_VALUE.

           MOVE FUNCTION upper-case (USER_RSPONSE) TO USER_RSPONSE_STORE
           .
           INSPECT POSITIVE_ANSWERS
             TALLYING USER_VALUE FOR ALL USER_RSPONSE_STORE(1:1)
           .

           EXIT PROGRAM.
